uhnp/src/InformationRegisters/ИсторияВыполненияПроцессов/ИсторияВыполненияПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияВыполненияПроцессов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Событие</name>
    <type>
      <types>EnumRef.ВидыОповещенийПользователейУХ</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>КомментарийСистемы</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>УдалитьПериодСортировки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодСортировкиМс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументПроцесса</name>
    <type>
      <types>DocumentRef.ЭкземплярПроцесса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапПроцесса</name>
    <type>
      <types>CatalogRef.ЭтапыУниверсальныхПроцессов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ИсторияСогласованияОбъектов/ИсторияСогласованияОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияСогласованияОбъектов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Событие</name>
    <type>
      <types>EnumRef.ВидыОповещенийПользователейУХ</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>КомментарийСистемы</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ПериодСортировкиМс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектСогласования</name>
    <type>
      <types>DefinedType.ОбъектыДляСогласования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачалаСогласования</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапПроцесса</name>
    <type>
      <types>CatalogRef.ЭтапыУниверсальныхПроцессов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ИсторияВыполненияПроцессов/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	Для Каждого ТекЗапись Из ЭтотОбъект Цикл
		ТекЗапись.ПериодСортировкиМс = ТекущаяУниверсальнаяДатаВМиллисекундах();
	КонецЦикла;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
		
	КлючевойОбъектПроцесса = ЭтотОбъект.Отбор.ДокументПроцесса.Значение.КлючевойОбъектПроцесса;

	Если Метаданные.ОпределяемыеТипы.ОбъектыДляСогласования.Тип.СодержитТип(ТипЗнч(КлючевойОбъектПроцесса)) Тогда
		
		НаборЗаписейИсторияСогласованияОбъектов = РегистрыСведений.ИсторияСогласованияОбъектов.СоздатьНаборЗаписей();
		
		НаборЗаписейИсторияСогласованияОбъектов.Отбор.Период.Установить(ЭтотОбъект.Отбор.Период.Значение);
		НаборЗаписейИсторияСогласованияОбъектов.Отбор.ОбъектСогласования.Установить(КлючевойОбъектПроцесса);
		НаборЗаписейИсторияСогласованияОбъектов.Отбор.ДатаНачалаСогласования.Установить(ЭтотОбъект.Отбор.ДокументПроцесса.Значение.Дата);
		НаборЗаписейИсторияСогласованияОбъектов.Отбор.ЭтапПроцесса.Установить(ЭтотОбъект.Отбор.ЭтапПроцесса.Значение);
		НаборЗаписейИсторияСогласованияОбъектов.Отбор.ИдентификаторСообщения.Установить(ЭтотОбъект.Отбор.ИдентификаторСообщения.Значение);
				
		Для Каждого ТекЗапись Из ЭтотОбъект Цикл 
			НоваяЗапись = НаборЗаписейИсторияСогласованияОбъектов.Добавить();
			
			//Измерения
			НоваяЗапись.Период = ТекЗапись.Период;
			НоваяЗапись.ОбъектСогласования = КлючевойОбъектПроцесса;
			НоваяЗапись.ДатаНачалаСогласования = ТекЗапись.ДокументПроцесса.Дата;
			НоваяЗапись.ЭтапПроцесса = ТекЗапись.ЭтапПроцесса;
			НоваяЗапись.ИдентификаторСообщения = ТекЗапись.ИдентификаторСообщения;
			
			//Ресурсы
			НоваяЗапись.Пользователь = ТекЗапись.Пользователь;
			НоваяЗапись.Событие = ТекЗапись.Событие;
			НоваяЗапись.Комментарий = ТекЗапись.Комментарий;
			НоваяЗапись.КомментарийСистемы = ТекЗапись.КомментарийСистемы;
			
			//Реквизиты
			НоваяЗапись.ПериодСортировкиМс = ТекЗапись.ПериодСортировкиМс;
		КонецЦикла;
		
		Попытка
			НаборЗаписейИсторияСогласованияОбъектов.Записать(Замещение);
		Исключение
		КонецПопытки;
		
	КонецЕсли;
		
КонецПроцедуры
